# 19AI403 ASSIGNMENT-LAB INTRODUCTION
### Prepared By : K SANTHAN KUMAR
### Register Number : 212223240065
### DEPT : AIML 2nd YEAR

# **ACTIVITY 1 :** :

## Task 1. Write a Python program to select the 'name' and 'score' columns from the following DataFrame.

In [20]:
import pandas as pd
import numpy as np

exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 4, 3, 5, 3, 6, 1, 7, 1]
}

df = pd.DataFrame(exam_data)

selected_columns = df[['name', 'score']]
print(selected_columns)

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

## Task 2: Selecting the data where attempts are greater than 3.

In [2]:
filtered_data = df[df['attempts'] > 3]
print(filtered_data)

        name  score  attempts
2  Katherine   16.5         4
4      Emily    9.0         5
6    Matthew   14.5         6
8      Kevin    8.0         7

## Task 3: Indexing rows and columns based on conditions.

In [18]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
    'age': [25, 35, 40, 28],
    'gender': ['F', 'M', 'M', 'M'],
    'salary': [50000, 70000, 60000, 80000]
}

df = pd.DataFrame(data)

In [19]:
# a. Select rows where age is greater than 30:
age_filtered = df[df['age'] > 30]
print("Rows where age is greater than 30:\n", age_filtered)

Rows where age is greater than 30:
       name  age gender  salary
1      Bob   35      M   70000
2  Charlie   40      M   60000

In [5]:
# b. Select rows where name contains 'e':
name_filtered = df[df['name'].str.contains('e')]
print("Rows where name contains 'e':\n", name_filtered)

Rows where name contains 'e':
       name  age gender  salary
0    Alice   25      F   50000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [6]:
# c. Select rows where gender is 'M' and salary is greater than 65000:
gender_salary_filtered = df[(df['gender'] == 'M') & (df['salary'] > 65000)]
print("Rows where gender is 'M' and salary is greater than 65000:\n", gender_salary_filtered)

Rows where gender is 'M' and salary is greater than 65000:
    name  age gender  salary
1   Bob   35      M   70000
3  Dave   28      M   80000

In [7]:
# d. Select columns 'name' and 'age'
name_age = df[['name', 'age']]
print("Columns 'name' and 'age':\n", name_age)

Columns 'name' and 'age':
       name  age
0    Alice   25
1      Bob   35
2  Charlie   40
3     Dave   28

# **ACTIVITY 2 :**

In [10]:
import pandas as pd

df_bank = pd.read_csv('/content/bank_train (1).csv')

## Task a: Select the rows where clients with primary education have subscribed to a deposit

In [11]:
primary_education_subscribed = df_bank.loc[(df_bank['education'] == 'primary') & (df_bank['deposit'] == 'yes')]
print(primary_education_subscribed)

      age          job   marital education default  balance housing loan  \
29     39  blue-collar  divorced   primary      no   1317.0     yes   no
39     31   unemployed    single   primary      no    163.0      no   no
56     49  blue-collar    single   primary      no    566.0     yes   no
66     53  blue-collar   married   primary     yes   -462.0      no   no
103    42  blue-collar    single   primary      no   4930.0      no   no
...   ...          ...       ...       ...     ...      ...     ...  ...
4411   55    housemaid   married   primary      no      0.0     yes   no
4422   80      retired   married   primary      no   1468.0      no   no
4451   41  blue-collar   married   primary      no    143.0     yes  yes
4452   53  blue-collar   married   primary      no    421.0     yes   no
4458   32  blue-collar   married   primary      no   -454.0     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome  \
29    cellular   20   nov       543         1    170         4    other
39    cellular   30   jan       707         2      2         1    other
56    cellular   25   jul       979         2     -1         0  unknown
66    cellular   29   jan       470         1     -1         0  unknown
103    unknown   18   jun       973         1     -1         0  unknown
...        ...  ...   ...       ...       ...    ...       ...      ...
4411  cellular   17   jul      1303         2     -1         0  unknown
4422  cellular   13   jan       330         3     -1         0  unknown
4451   unknown    2   jun       659         2     -1         0  unknown
4452  cellular   20   nov       677         1     -1         0  unknown
4458  cellular   18   may       801         5    355         2  failure

     deposit
29       yes
39       yes
56       yes
66       yes
103      yes
...      ...
4411     yes
4422     yes
4451     yes
4452     yes
4458     yes

[243 rows x 17 columns]

## Task b: Select the rows where clients have not subscribed to a deposit

In [12]:
not_subscribed = df_bank.loc[df_bank['deposit'] == 'no']
print(not_subscribed)

      age          job   marital  education default  balance housing loan  \
0      76      retired   married  secondary      no   2302.0      no   no
3      41  blue-collar   married  secondary      no    356.0     yes   no
6      59      retired   married  secondary      no    136.0      no   no
7      34  blue-collar   married    primary      no   5299.0     yes   no
9      44  blue-collar   married  secondary      no    879.0     yes   no
...   ...          ...       ...        ...     ...      ...     ...  ...
4457   43   management   married   tertiary      no   1336.0     yes  yes
4460   54      retired   married  secondary      no    522.0      no  yes
4461   33   management   married   tertiary      no    133.0     yes   no
4464   31   technician    single  secondary      no    628.0     yes   no
4465   70      retired  divorced    primary      no    383.0      no   no

        contact  day month  duration  campaign  pdays  previous poutcome  \
0     telephone    5   feb       110         1     87         2  failure
3      cellular   14   may        90         5     -1         0  unknown
6      cellular    6   aug       301         4     -1         0  unknown
7       unknown   26   jun        75         5     -1         0  unknown
9      cellular    3   apr       383         1     -1         0  unknown
...         ...  ...   ...       ...       ...    ...       ...      ...
4457   cellular   27   may        82         2    309         1  failure
4460   cellular   14   jul        81         3     -1         0  unknown
4461    unknown   26   may       308         4     -1         0  unknown
4464    unknown   12   may      1083         2     -1         0  unknown
4465   cellular   28   apr        50         2     -1         0  unknown

     deposit
0         no
3         no
6         no
7         no
9         no
...      ...
4457      no
4460      no
4461      no
4464      no
4465      no

[2354 rows x 17 columns]

## Task c: Select the rows where clients who have subscribed to a deposit either have a housing or a personal loan

In [13]:
subscribed_with_loans = df_bank.loc[(df_bank['deposit'] == 'yes') & ((df_bank['housing'] == 'yes') | (df_bank['loan'] == 'yes'))]
print(subscribed_with_loans)

      age          job   marital  education default  balance housing loan  \
2      51   management   married   tertiary      no   2455.0     yes   no
4      51   technician   married  secondary      no  -1944.0     yes   no
15     37   management    single   tertiary      no    455.0     yes   no
17     24       admin.    single   tertiary      no      0.0     yes   no
21     33       admin.   married   tertiary      no     79.0     yes   no
...   ...          ...       ...        ...     ...      ...     ...  ...
4454   30  blue-collar    single  secondary      no    155.0     yes  yes
4458   32  blue-collar   married    primary      no   -454.0     yes  yes
4459   37   technician    single  secondary      no   3326.0     yes   no
4462   39     services  divorced  secondary      no    687.0     yes   no
4463   40       admin.    single  secondary      no   2040.0     yes   no

       contact  day month  duration  campaign  pdays  previous poutcome  \
2     cellular   21   jul       553         1     -1         0  unknown
4     cellular    7   may       623         1     -1         0  unknown
15    cellular   13   aug       904         6     -1         0  unknown
17    cellular   27   may       122         2     -1         0  unknown
21    cellular    5   may       389         1    195         4  success
...        ...  ...   ...       ...       ...    ...       ...      ...
4454  cellular    9   jul      1426         3     -1         0  unknown
4458  cellular   18   may       801         5    355         2  failure
4459   unknown   21   may       799         1     -1         0  unknown
4462  cellular    9   jul       869         1     -1         0  unknown
4463  cellular   18   may       906         2    350         2  failure

     deposit
2        yes
4        yes
15       yes
17       yes
21       yes
...      ...
4454     yes
4458     yes
4459     yes
4462     yes
4463     yes

[893 rows x 17 columns]

## Task d: Select the rows where clients with secondary education who have not subscribed to a deposit

In [14]:
secondary_not_subscribed = df_bank.loc[(df_bank['education'] == 'secondary') & (df_bank['deposit'] == 'no')]
print(secondary_not_subscribed)

      age          job  marital  education default  balance housing loan  \
0      76      retired  married  secondary      no   2302.0      no   no
3      41  blue-collar  married  secondary      no    356.0     yes   no
6      59      retired  married  secondary      no    136.0      no   no
9      44  blue-collar  married  secondary      no    879.0     yes   no
10     34     services  married  secondary      no   1637.0     yes   no
...   ...          ...      ...        ...     ...      ...     ...  ...
4446   35     services  married  secondary      no      0.0     yes   no
4453   31     services  married  secondary      no    505.0      no   no
4456   54  blue-collar  married  secondary      no   -102.0     yes   no
4460   54      retired  married  secondary      no    522.0      no  yes
4464   31   technician   single  secondary      no    628.0     yes   no

        contact  day month  duration  campaign  pdays  previous poutcome  \
0     telephone    5   feb       110         1     87         2  failure
3      cellular   14   may        90         5     -1         0  unknown
6      cellular    6   aug       301         4     -1         0  unknown
9      cellular    3   apr       383         1     -1         0  unknown
10     cellular   21   nov       107         4     -1         0  unknown
...         ...  ...   ...       ...       ...    ...       ...      ...
4446   cellular   24   jul       810         1     -1         0  unknown
4453   cellular   11   jul       773         3     -1         0  unknown
4456   cellular   27   aug       164         7     -1         0  unknown
4460   cellular   14   jul        81         3     -1         0  unknown
4464    unknown   12   may      1083         2     -1         0  unknown

     deposit
0         no
3         no
6         no
9         no
10        no
...      ...
4446      no
4453      no
4456      no
4460      no
4464      no

[1229 rows x 17 columns]

## Task e: Select the rows where clients who have subscribed to a term deposit as an outcome of the successful marketing campaign

In [15]:
subscribed_success = df_bank.loc[(df_bank['deposit'] == 'yes') & (df_bank['poutcome'] == 'success')]
print(subscribed_success)

      age            job   marital  education default  balance housing loan  \
19     76  self-employed   married    unknown      no   4984.0      no   no
21     33         admin.   married   tertiary      no     79.0     yes   no
45     71        retired  divorced  secondary      no      0.0      no   no
51     68        retired   married  secondary      no   1146.0      no   no
52     46     management   married   tertiary      no    273.0     yes   no
...   ...            ...       ...        ...     ...      ...     ...  ...
4338   38         admin.  divorced  secondary      no     19.0     yes   no
4372   20        student    single  secondary      no    215.0      no   no
4376   42     technician   married  secondary      no    994.0     yes   no
4408   29      housemaid    single   tertiary      no     19.0      no   no
4448   27    blue-collar    single  secondary      no    535.0      no   no

        contact  day month  duration  campaign  pdays  previous poutcome  \
19    telephone   28   apr       403         1    182         1  success
21     cellular    5   may       389         1    195         4  success
45     cellular   26   feb       771         1    171         1  success
51     cellular   13   may       356         1     71         5  success
52     cellular   18   mar       910         2    184         4  success
...         ...  ...   ...       ...       ...    ...       ...      ...
4338   cellular    5   feb      1130         3    251         2  success
4372   cellular   24   feb       175         1     92         6  success
4376   cellular   12   nov       227         3     93         6  success
4408   cellular    4   may       268         1     88         4  success
4448   cellular   16   aug       265         3     95         4  success

     deposit
19       yes
21       yes
45       yes
51       yes
52       yes
...      ...
4338     yes
4372     yes
4376     yes
4408     yes
4448     yes

[392 rows x 17 columns]

## Task f: Select the rows where unemployed clients have not subscribed to deposit

In [16]:
unemployed_not_subscribed = df_bank.loc[(df_bank['job'] == 'unemployed') & (df_bank['deposit'] == 'no')]
print(unemployed_not_subscribed)

      age         job   marital  education default  balance housing loan  \
74     37  unemployed    single  secondary      no     48.0      no   no
304    48  unemployed   married  secondary      no    855.0     yes   no
404    57  unemployed   married    primary      no      0.0     yes   no
464    47  unemployed  divorced  secondary      no    947.0      no   no
494    45  unemployed   married   tertiary      no   1148.0      no   no
550    55  unemployed   married    primary      no   8585.0      no   no
644    35  unemployed    single  secondary      no   2116.0     yes   no
690    31  unemployed    single    unknown      no    167.0      no   no
705    42  unemployed  divorced  secondary      no    759.0      no   no
811    38  unemployed   married  secondary      no    995.0      no   no
821    43  unemployed   married  secondary      no   1943.0     yes   no
827    52  unemployed   married  secondary      no   1639.0      no   no
856    31  unemployed   married  secondary      no     20.0      no   no
966    42  unemployed   married  secondary      no   -165.0     yes  yes
967    57  unemployed   married  secondary      no   1350.0      no   no
1003   35  unemployed   married  secondary      no   2080.0     yes   no
1123   50  unemployed   married  secondary      no   3478.0     yes   no
1236   43  unemployed  divorced  secondary      no   1854.0      no   no
1351   38  unemployed  divorced  secondary      no    189.0     yes  yes
1424   40  unemployed  divorced  secondary      no    262.0     yes   no
1633   41  unemployed    single   tertiary      no   4517.0     yes   no
1828   31  unemployed    single  secondary      no    209.0     yes   no
1848   41  unemployed   married    primary      no    183.0     yes   no
1850   30  unemployed   married  secondary      no    142.0     yes   no
1961   58  unemployed   married  secondary      no    610.0     yes   no
2060   33  unemployed    single  secondary      no    233.0     yes   no
2184   41  unemployed  divorced  secondary      no    271.0     yes   no
2292   40  unemployed   married  secondary      no   1289.0      no   no
2308   50  unemployed   married  secondary      no    297.0     yes   no
2364   43  unemployed   married  secondary      no    553.0      no   no
2464   55  unemployed   married    primary      no   1221.0      no  yes
2513   55  unemployed   married  secondary      no    512.0      no   no
2603   33  unemployed    single  secondary      no    682.0      no   no
2681   40  unemployed   married   tertiary      no   2430.0      no   no
2699   52  unemployed   married   tertiary      no   2133.0      no  yes
2754   55  unemployed   married   tertiary      no   5345.0      no   no
2762   43  unemployed   married  secondary      no    775.0      no   no
2827   54  unemployed    single  secondary      no   3611.0     yes   no
2913   44  unemployed   married    primary      no     97.0     yes   no
2929   40  unemployed   married  secondary      no   1077.0     yes  yes
3145   36  unemployed   married  secondary      no    439.0     yes   no
3263   47  unemployed    single  secondary      no   4819.0      no   no
3313   45  unemployed    single  secondary      no    382.0     yes  yes
3556   40  unemployed   married  secondary      no    219.0     yes   no
3704   59  unemployed    single  secondary      no    865.0      no   no
3733   46  unemployed  divorced  secondary      no      0.0      no   no
3745   58  unemployed    single   tertiary      no   2094.0      no   no
3905   33  unemployed   married   tertiary      no   3335.0      no   no
3949   46  unemployed   married  secondary      no   2940.0     yes   no
4027   36  unemployed    single   tertiary      no    221.0      no   no
4066   42  unemployed   married   tertiary      no      0.0      no   no
4102   30  unemployed    single  secondary      no      0.0     yes   no
4125   27  unemployed    single   tertiary      no   3060.0      no   no
4130   34  unemployed   married  secondary      no    200.0     yes   no
4140   37  unemployed   married  secondary      no   4769.0      no   no
4179   43  unemployed  divorced  secondary      no      0.0     yes   no
4181   46  unemployed   married  secondary      no  16397.0      no   no
4271   49  unemployed   married  secondary      no  13818.0      no   no
4289   27  unemployed    single  secondary      no      0.0     yes   no
4395   26  unemployed   married  secondary      no    285.0     yes   no

        contact  day month  duration  campaign  pdays  previous poutcome  \
74     cellular   31   jul        40        10     -1         0  unknown
304     unknown    9   may       241         2     -1         0  unknown
404    cellular   20   nov       231         2     -1         0  unknown
464    cellular    5   feb       124         2     -1         0  unknown
494    cellular   19   nov       782         2     -1         0  unknown
550   telephone   28   jan       201         2     -1         0  unknown
644    cellular   13   may       409         2     -1         0  unknown
690    cellular   20   nov       316         1     -1         0  unknown
705    cellular   28   jan        97         1    169         3  failure
811     unknown   26   jul        84         1     -1         0  unknown
821    cellular   18   nov       202         2     -1         0  unknown
827    cellular    8   aug        93         1     -1         0  unknown
856   telephone   18   nov        52         1     -1         0  unknown
966     unknown   27   may       179         3     -1         0  unknown
967    cellular   25   jun       131         1    388         1  failure
1003  telephone   14   apr       266         3     -1         0  unknown
1123    unknown   13   may       342         3     -1         0  unknown
1236   cellular   13   nov       131         2    197         1  success
1351   cellular   21   jul       105         2     -1         0  unknown
1424    unknown   14   may       163         5     -1         0  unknown
1633   cellular   20   nov       137         1     -1         0  unknown
1828   cellular    6   may       193         1     -1         0  unknown
1848   cellular   29   jul       271         1     -1         0  unknown
1850    unknown   20   may       350         4     -1         0  unknown
1961  telephone   29   jul       246         2     -1         0  unknown
2060    unknown    8   may       221         4     -1         0  unknown
2184    unknown   19   jun       196         2     -1         0  unknown
2292   cellular   26   may       260         2     -1         0  unknown
2308   cellular   31   jul        29        10     -1         0  unknown
2364  telephone    4   feb       125         1     -1         0  unknown
2464   cellular    8   jul       108         1     -1         0  unknown
2513   cellular   28   jan        70         1     -1         0  unknown
2603   cellular    5   feb       251         1     -1         0  unknown
2681   cellular   24   aug        87         2     -1         0  unknown
2699   cellular   18   jul        90         1     -1         0  unknown
2754    unknown    6   may       278         1     -1         0  unknown
2762   cellular   14   aug        98         1    106         1  failure
2827   cellular    5   feb        81         1     -1         0  unknown
2913    unknown    5   jun       105         3     -1         0  unknown
2929   cellular   17   nov       148         2     -1         0  unknown
3145  telephone    6   feb        18         6     -1         0  unknown
3263   cellular   18   nov       144         1     -1         0  unknown
3313   cellular   18   may       182         1     -1         0  unknown
3556    unknown    5   may       357         1     -1         0  unknown
3704   cellular    4   feb      1086         1     -1         0  unknown
3733   cellular   30   jul       638         3     -1         0  unknown
3745   cellular    1   jun       161         2     -1         0  unknown
3905   cellular   15   jun        92         1    301         6  failure
3949    unknown   29   may       195         2     -1         0  unknown
4027   cellular    3   feb       225         4     -1         0  unknown
4066   cellular    8   oct       113         1     -1         0  unknown
4102   cellular   16   apr       137         1     -1         0  unknown
4125   cellular   30   jan       533         1     -1         0  unknown
4130    unknown   26   may       155         6     -1         0  unknown
4140   cellular   29   jan       124         1     -1         0  unknown
4179   cellular   24   jul       229         2     -1         0  unknown
4181   cellular   18   nov       641         1     -1         0  unknown
4271   cellular   21   nov       201         1    113         2  failure
4289   cellular   21   jul        53         6     -1         0  unknown
4395   cellular    6   may       265         2    342         2  failure

     deposit
74        no
304       no
404       no
464       no
494       no
550       no
644       no
690       no
705       no
811       no
821       no
827       no
856       no
966       no
967       no
1003      no
1123      no
1236      no
1351      no
1424      no
1633      no
1828      no
1848      no
1850      no
1961      no
2060      no
2184      no
2292      no
2308      no
2364      no
2464      no
2513      no
2603      no
2681      no
2699      no
2754      no
2762      no
2827      no
2913      no
2929      no
3145      no
3263      no
3313      no
3556      no
3704      no
3733      no
3745      no
3905      no
3949      no
4027      no
4066      no
4102      no
4125      no
4130      no
4140      no
4179      no
4181      no
4271      no
4289      no
4395      no

## Task g: Select columns 'name' and 'salary' where age is less than or equal to 30

###### This specific question mentions "name" and "salary", but since the bank_train.csv data columns don't have "name" and "salary" (but rather "job" and "balance" could be considered as close equivalents), the code would be:

In [17]:
young_clients = df_bank.loc[df_bank['age'] <= 30, ['job', 'balance']]
print(young_clients)

              job  balance
17         admin.      0.0
22    blue-collar    544.0
26       services     30.0
27       services    195.0
40     technician    743.0
...           ...      ...
4440       admin.    674.0
4448  blue-collar    535.0
4449  blue-collar     81.0
4454  blue-collar    155.0
4455   management    265.0

[809 rows x 2 columns]